app/views/levels/index.html.haml

SELECT COUNT(*) FROM `subjects` WHERE `subjects`.`level_id` = 1
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`level_id` = 1
SELECT COUNT(*) FROM `exams` WHERE `exams`.`level_id` = 1
SELECT `exams`.* FROM `exams` WHERE `exams`.`level_id` = 1
---
        %td= link_to "Create subjects for this level", new_level_subject_path(level)
        %td= link_to "View subjects of this level", level_subjects_path(level) if level.subjects.size > 0
        %td= link_to "Create exam for this level", new_level_exam_path(level)
        %td= link_to "View exams and their details of this level", level_exams_path(level) if level.exams.size > 0