app/controllers/chapters_controller.rb

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def index
    @subject = Subject.find(params[:subject_id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def new
    @subject = Subject.find(params[:subject_id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def create
    @subject = Subject.find(params[:subject_id])

SELECT  `chapters`.* FROM `chapters` WHERE `chapters`.`id` = 1 LIMIT 1
---
    def set_chapter
      @chapter = Chapter.find(params[:id])