app/controllers/exams_controller.rb

  def index
    @level = Level.find(params[:level_id])
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1

  def new
    @level = Level.find(params[:level_id])
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1

  def create
    @level = Level.find(params[:level_id])

    @exam = @level.exams.build(exam_params)

    respond_to do |format|
      if @exam.save
      if params[:subjects] != nil

        params[:subjects].each do |subject|
          @es = ExamsSubject.new()
          @es.exam_id = @exam.id
          @es.subject_id = subject
          if @es.save
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1
INSERT INTO `exams` (`exam_name`, `exam_date`, `exam_discription`, `exam_instructions`, `level_id`, `created_at`, `updated_at`) VALUES ('Entranse Test', '2017-09-18', '', 'Hello Hello Hello\r\nHello Hello Hello', 1, '2017-08-17 09:40:49', '2017-08-17 09:40:49')
INSERT INTO `exams_subjects` (`exam_id`, `subject_id`, `created_at`, `updated_at`) VALUES (2, 1, '2017-08-17 13:10:24', '2017-08-17 13:10:24')

  def setpaper
    @exam = Exam.find(params[:exam_id])
    if request.post?
      @paper = Paper.new()
      @paper.exam_id = @exam.id
      @paper.paper_name = params[:paperName]
      if @paper.save
        if params[:questions] != nil
          params[:questions].each do |q|
            @question = Question.find(q)
            @question.paper_id = @paper.id
            if @question.save
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1
INSERT INTO `papers` (`exam_id`, `paper_name`, `created_at`, `updated_at`) VALUES (3, 'First paper', '2017-08-19 18:47:54', '2017-08-19 18:47:54')
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
UPDATE `questions` SET `paper_id` = 1, `updated_at` = '2017-08-19 18:47:54' WHERE `questions`.`id` = 2

  def setting
    @exam = Exam.find(params[:exam_id])
    @paper = @exam.papers.where(:attempt_flag => nil)
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 3 LIMIT 1
SELECT `papers`.* FROM `papers` WHERE `papers`.`exam_id` = 3 AND `papers`.`attempt_flag` IS NULL

  def currentpaper
    @exam = Exam.find(params[:exam_id])
    @paper = @exam.papers.where(:attempt_flag => nil)
    if request.put?
      @p = Paper.find(params[:paper])
      @p.current_paper_flag = true
      if @p.save
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 3 LIMIT 1
SELECT `papers`.* FROM `papers` WHERE `papers`.`exam_id` = 3 AND `papers`.`attempt_flag` IS NULL
SELECT  `papers`.* FROM `papers` WHERE `papers`.`id` = 1 LIMIT 1
UPDATE `papers` SET `current_paper_flag` = 1, `updated_at` = '2017-08-19 18:49:15' WHERE `papers`.`id` = 1

  def examinstruction
    @exam = Exam.find(params[:format])
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = NULL LIMIT 1

  def giveexam
    @questions_count = []
    @exam = Exam.find(params[:exam_id])
    @paper = @exam.papers.where(:current_paper_flag => true)
    @paper.last.questions.each do |q|
      @questions_count.push(q.id)
    end
    if request.post?
      @attempt = Attempt.new()
      @attempt.paper_id = @paper.last.id
      @attempt.student_id = current_user.student.id
      @attempt.total_marks = @questions_count.size
      # Calculate the cutoff in next line:
      # Use the temp varible to store the value of @questions_count.size in somewhere:
      @min_marks_var = @questions_count.size
      @attempt.require_marks = @min_marks_var *40/100
      @attempt.attempted_date = Date.today
      if @attempt.save
        @paper.last.questions.each_index do |i|
          p 'q var is,'
          @q = @paper.last.questions[i]
          if params[@q.id.to_s]
            @option = Option.find(params[@q.id.to_s])
            @option.attempt_id = @attempt.id
            if @option.save
            end
          end
        end
        @get_marks = @attempt.options.where(:option_right => true)
        @calculate_marks = @get_marks.size
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 4 LIMIT 1
SELECT  `papers`.* FROM `papers` WHERE `papers`.`exam_id` = 4 AND `papers`.`current_paper_flag` = 1  ORDER BY `papers`.`id` DESC LIMIT 1
SELECT  `students`.* FROM `students` WHERE `students`.`user_id` = 4 LIMIT 1
INSERT INTO `attempts` (`paper_id`, `student_id`, `total_marks`, `require_marks`, `attempted_date`, `created_at`, `updated_at`) VALUES (2, 1, 10, 4, '2017-08-19', '2017-08-19 21:56:37', '2017-08-19 21:56:37')
SELECT `options`.* FROM `options` WHERE `options`.`question_id` = 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`paper_id` = 2
UPDATE `options` SET `attempt_id` = 1, `updated_at` = '2017-08-19 21:56:37' WHERE `options`.`id` = 1
SELECT COUNT(*) FROM `options` WHERE `options`.`attempt_id` = 1 AND `options`.`option_right` = 1

          end
        @result.attempt_id = @attempt.id
        @result.student_id = current_user.student.id
        if @result.save
---
INSERT INTO `results` (`result_status`, `get_marks`, `total_marks`, `min_marks`, `attempt_id`, `student_id`, `created_at`, `updated_at`) VALUES ('FAIL', 0, 10, 4, 3, 1, '2017-08-19 22:00:35', '2017-08-19 22:00:35')

  def result
    @result = Result.find(params[:format])
---
SELECT  `results`.* FROM `results` WHERE `results`.`id` = 2 LIMIT 1

    def set_exam
      @exam = Exam.find(params[:id])
---
SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1