app/controllers/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT `levels`.* FROM `levels`

  def create
    @level = Level.new(level_params)

    respond_to do |format|
      if @level.save
---
INSERT INTO `levels` (`title`, `start_date`, `end_date`, `level_remarks`, `days_of_week`, `created_at`, `updated_at`) VALUES ('Entry level', '2017-08-16', '2017-08-18', '', 'Only saturday sunday and public holidays', '2017-08-15 18:14:20', '2017-08-15 18:14:20')

  def assignleveltostudent
    @level = Level.find(params[:level_id])
    if request.get?
      @studentl = Student.includes(:levels).where(levels: {id: nil})
    end
    if request.post? && params != nil
      params[:students].each do |student_id|
        p " The ppar is,"

    p params
    @level_students  = LevelsStudent.new()
    @level_students.level_id = @level.id
 @level_students.student_id = student_id
@student = Student.find(student_id)
@student.current_level = @level.id
  if @level_students.save && @student.save
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1
SELECT `students`.* FROM `students` WHERE (id NOT IN (1))
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
INSERT INTO `levels_students` (`level_id`, `student_id`, `created_at`, `updated_at`) VALUES (2, 1, '2017-08-16 09:18:23', '2017-08-16 09:18:23')
UPDATE `students` SET `current_level` = 1, `updated_at` = '2017-08-27 10:16:27' WHERE `students`.`id` = 1

  def viewstudents
    @level = Level.find(params[:level_id])
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1

    def set_level
      @level = Level.find(params[:id])
---
SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1