app/controllers/questions_controller.rb

  def index
    @subject = Subject.find(params[:subject_id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1

  def new
    @subject = Subject.find(params[:subject_id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1

  def create
    @subject = Subject.find(params[:subject_id])
    @question = @subject.questions.build(question_params)

    respond_to do |format|
      if @question.save
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1
INSERT INTO `questions` (`assking_question`, `type_of_question`, `question_discription`, `subject_id`, `created_at`, `updated_at`) VALUES ('Who is the JAWS', 'Regular', '', 2, '2017-08-17 15:25:03', '2017-08-17 15:25:03')

  def destroy
    @question.destroy
---
DELETE FROM `questions` WHERE `questions`.`id` = 26