app/controllers/requests_controller.rb

  def index
    @requests = Request.all
---
SELECT `requests`.* FROM `requests`

  def create
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save
---
INSERT INTO `requests` (`first_name`, `last_name`, `email`, `mobile`, `address_one`, `address_two`, `state`, `city`, `pin`, `accept_flag`, `created_at`, `updated_at`) VALUES ('Vishal', 'Pawle', 'vishalpawle91@gmail.com', '9637290294', 'abc', 'abc', 'acb', 'abc', 123456, 0, '2017-08-14 17:06:47', '2017-08-14 17:06:47')

    def set_request
      @request = Request.find(params[:id])
---
SELECT  `requests`.* FROM `requests` WHERE `requests`.`id` = 1 LIMIT 1