app/controllers/students_controller.rb

SELECT `students`.* FROM `students`
---
  def index
    if current_user.role == 'admin' || current_user.role == 'teacher'
      @students = Student.all

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 3 LIMIT 1
SELECT  `levels`.* FROM `levels` INNER JOIN `levels_students` ON `levels`.`id` = `levels_students`.`level_id` WHERE `levels_students`.`student_id` = 3  ORDER BY `levels`.`id` DESC LIMIT 1
---
  def mylevels
    @student = Student.find(params[:student_id])
    @studentlevels = @student.levels
    @current_student_level = @student.levels.last

INSERT INTO `students` (`first_name`, `last_name`, `mid_name`, `gender`, `date_of_birth`, `mobile_number`, `email`, `address_one`, `address_two`, `address_three`, `city`, `state`, `pin`, `occupation`, `qualification`, `have_you_completed_any_computer_cource`, `course_name`, `computer_literacy_level`, `percentages_of_blindness`, `which_assistive_technology_do_you_use`, `do_you_have_membership_of_nfbmpune`, `tirms`, `user_id`, `created_at`, `updated_at`) VALUES ('Vishal', 'Pawle', 'Hanumant', 'Male', '1991-07-13', '9637290294', 'vishal.pawle@nfbmpune.org', 'At post oshade ', 'Sonapur gaonthan', 'Taluka Haveli', 'Pune', 'Maharashtra', 411025, 'Employed', 'Graduate', 'Yes', 'C programming', 'Advanced I.E MS Office / MS Access / Programming etc', 'More than 40%', 'JAWS (Job access with speech) for microsoft windows', 'Yes', 1, 4, '2017-08-15 11:23:29', '2017-08-15 11:23:29')
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

DELETE FROM `students` WHERE `students`.`id` = 1
---
  def destroy
    @student.destroy

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
    def set_student
      @student = Student.find(params[:id])