app/controllers/subjects_controller.rb

SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1
---
  def index
    @level = Level.find(params[:level_id])

SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1
---
  def new
    @level = Level.find(params[:level_id])

SELECT  `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1
INSERT INTO `subjects` (`subject_name`, `subject_discription`, `level_id`, `created_at`, `updated_at`) VALUES ('Computer', '', 1, '2017-08-17 06:00:37', '2017-08-17 06:00:37')
---
  def create
    @level = Level.find(params[:level_id])
    @subject = @level.subjects.build(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM `subjects` WHERE `subjects`.`id` = 2
---
  def destroy
    @subject.destroy

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1
---
    def set_subject
      @subject = Subject.find(params[:id])