app/controllers/teachers_controller.rb

  def index
    if current_user.role == 'admin'
      @teachers = Teacher.all
---
SELECT `teachers`.* FROM `teachers`

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO `teachers` (`first_name`, `last_name`, `gender`, `date_of_birth`, `mobile_number`, `email`, `listening_skills_jaws`, `writing_skills_with_jaws`, `strengths`, `weaknesses`, `tirms`, `user_id`, `created_at`, `updated_at`) VALUES ('Vikas', 'Waghmare', 'Male', '1991-07-13', '9637290294', 'vikas.waghmare@nfbmpune.org', 'Agreeable / Fine', 'Agreeable / Fine', '1. Working Man plus kaam person.\r\n2. I love to help other people.\r\n3. I can share my knowledge with any one properly.', '1. I am very emotional man.\r\n2. Sometime grasping take by other way.\r\n3. Require guidance from some one for big desission', 1, 6, '2017-08-15 15:58:29', '2017-08-15 15:58:29')

  def assignleveltoteacher
    @teacher = Teacher.find(params[:teacher_id])
    @exclude_ids_array = []
    if request.get?
      @teacherlevels = @teacher.levels
      if @teacherlevels.size > 0
          @teacherlevels.each do |tl|
            @exclude_ids_array.push(tl.id)
          end
        @assign_var = Level.where.not(id: @exclude_ids_array)
      else
        @assign_var = Level.all
      end
    end
    if request.post? && params != nil
      params[:levels].each do |ls|
        @level_teachers = LevelsTeacher.new()
        @level_teachers.teacher_id = @teacher.id
        @level_teachers.level_id = ls
        if @level_teachers.save
---
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `levels` INNER JOIN `levels_teachers` ON `levels`.`id` = `levels_teachers`.`level_id` WHERE `levels_teachers`.`teacher_id` = 1
SELECT `levels`.* FROM `levels` INNER JOIN `levels_teachers` ON `levels`.`id` = `levels_teachers`.`level_id` WHERE `levels_teachers`.`teacher_id` = 1
INSERT INTO `levels_teachers` (`teacher_id`, `level_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-08-16 16:30:05', '2017-08-16 16:30:05')

  def readmylevel
    @teacher = Teacher.find(params[:teacher_id])
---
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = 1 LIMIT 1

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = 1 LIMIT 1