app/views/exams/_examinstruction.html.haml

SELECT COUNT(*) FROM `subjects` INNER JOIN `exams_subjects` ON `subjects`.`id` = `exams_subjects`.`subject_id` WHERE `exams_subjects`.`exam_id` = 1
SELECT `subjects`.* FROM `subjects` INNER JOIN `exams_subjects` ON `subjects`.`id` = `exams_subjects`.`subject_id` WHERE `exams_subjects`.`exam_id` = 1
---
%ol
  %li The paper is designed in #{@exam.subjects.size} subjects.
  %ul