app/views/exams/_form.html.haml

SELECT COUNT(*) FROM `subjects` WHERE `subjects`.`level_id` = 1
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`level_id` = 1
---
- if @level.subjects.size >= 2