app/views/exams/result.html.haml

      %tr
        %td= @result.attempt.student.first_name.capitalize + " " + @result.attempt.student.last_name.capitalize
---
SELECT  `attempts`.* FROM `attempts` WHERE `attempts`.`id` = 2 LIMIT 1
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1