app/views/exams/setpaper.html.haml

  = text_field_tag 'paperName'
  - @exam.subjects.each do |subject|
    %h2 Questions under #{subject.subject_name} subject
    - subject.questions.each do |question|
---
SELECT `subjects`.* FROM `subjects` INNER JOIN `exams_subjects` ON `subjects`.`id` = `exams_subjects`.`subject_id` WHERE `exams_subjects`.`exam_id` = 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`subject_id` = 1